Merge pull request #30 from kokoichi206/issue/29
ドキュメントのmermaid移行対応
