--- a/docs/class/main.md
+++ b/docs/class/main.md
@@ -28,122 +28,58 @@
 
 ## シーケンス図
 
-``` plantuml
-@startuml
+``` mermaid
+%%{init: {'theme': 'forest' } }%%
+sequenceDiagram
+    actor User
+    participant MainActivity as <<View:UI制御>><br />MainActivity
+    participant MainPresenter as <<Presenter:ビジネスロジック>><br />MainPresenter
+    participant MainInteractor as <<Interactor:機能>><br />MainInteractor
+    participant MainRouter as <<Router:画面遷移>><br />MainRouter
 
-actor User
-participant MainActivity <<View:UI制御>>
-participant MainPresenter <<Presenter:ビジネスロジック>>
-participant MainInteractor <<Interactor:機能>>
-participant MainRouter <<Router:画面遷移>>
+    note over User,MainRouter: 画面生成
+    User ->> MainActivity : アプリ起動。
+    MainActivity ->> MainPresenter : onCreate()
+    MainPresenter ->> MainInteractor : readInitialSettings()
+    note right of MainInteractor: DataStoreManager#readString()
+    alt 前データが存在する
+    MainInteractor ->> MainPresenter : onReadInitialSettingsCompleted()
+    else 前データが存在しない
+    MainInteractor ->> MainPresenter : onReadInitialSettingsFailed()
+    end
 
-==画面生成==
-User -> MainActivity : アプリ起動。
-MainActivity -> MainPresenter : onCreate()
-MainPresenter -> MainInteractor : readInitialSettings()
-note right : DataStoreManager#readString()
-alt 前データが存在する
-MainPresenter <-- MainInteractor : onReadInitialSettingsCompleted()
-MainActivity <- MainPresenter : setMainViewWithTime()
-User <- MainActivity : 前回のデータを引き継いだ\nホーム画面を表示する。
-else 前データが存在しない
-MainPresenter <-- MainInteractor : onReadInitialSettingsFailed()
-MainActivity <- MainPresenter : setMainView()
-User <- MainActivity : ホーム画面を表示する。
-end
+    note over User,MainRouter: メニュー表示
+    User ->> MainActivity : 縦三点ボタンをクリック。
+    MainActivity ->> User : メニューを表示させる。
+    opt ライセンス情報
+    User ->> MainActivity : ライセンスメニューをクリック。
+    MainActivity ->> MainPresenter : onLicenseClicked()
+    MainPresenter ->> MainRouter : launchLicenseActivity()
+    MainRouter ->> User : ライセンス画面を表示させる。
+    end
+    opt プライバシーポリシー
+    User ->> MainActivity : プライバシーポリシーメニューをクリック。
+    MainActivity ->> MainPresenter : onPrivacyPolicyClicked()
+    MainPresenter ->> MainRouter : launchPrivacyPolicyActivity()
+    MainRouter ->> User : プライバシーポリシー画面を表示させる。
+    end
+    User ->> MainActivity : メニューの外側をクリック。
+    MainActivity ->> User : メニューを閉じる。
+```
 
-==メニュー表示==
-User -> MainActivity : 縦三点ボタンをクリック。
-User <- MainActivity : メニューを表示させる。
-opt ライセンス情報
-User -> MainActivity : ライセンスメニューをクリック。
-MainActivity -> MainPresenter : onLicenseClicked()
-MainPresenter -> MainRouter : launchLicenseActivity()
-User <- MainRouter : ライセンス画面を表示させる。
-end
-opt プライバシーポリシー
-User -> MainActivity : プライバシーポリシーメニューをクリック。
-MainActivity -> MainPresenter : onPrivacyPolicyClicked()
-MainPresenter -> MainRouter : launchPrivacyPolicyActivity()
-User <- MainRouter : プライバシーポリシー画面を表示させる。
-end
-User -> MainActivity : メニューの外側をクリック。
-User <- MainActivity : メニューを閉じる。
-@enduml
@@
 ```
